Sem3/matan/practices/kr2.tex
% Created 2020-12-24 Thu 21:27
% Intended LaTeX compiler: pdflatex
\documentclass{article}
       \usepackage[T1, T2A]{fontenc}
\usepackage[lutf8]{luainputenc}
\usepackage[russian, english]{babel}
\usepackage{minted}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage{grffile}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage{placeins}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{capt-of}
       
       \usepackage{geometry}
       \geometry{a4paper,left=2.5cm,top=2cm,right=2.5cm,bottom=2cm,marginparsep=7pt, marginparwidth=.6in}
\author{Ilya Yaroshevskiy}
\date{\today}
\title{КР 2}
\hypersetup{
 pdfauthor={Ilya Yaroshevskiy},
 pdftitle={КР 2},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Степенные ряды}
\label{sec:orgda9c8f4}
\(\sum a_n(x - x_0)^n\) - сходится при \(|x - x_0| < R\) \\
\(R = \frac{1}{\lim{\sqrt[n]{|a_n|}}}[= \lim{\left|\frac{a_n}{a_{n + 1}}\right|}]\)

\emph{Прим.} \(\sum e^{-\ln{n}p}\), при \(p > 1\) сходится, \(p \le 1\) расходится

\section{Признаки}
\label{sec:org210b799}
\[ \sum a_n(x)b_n(x) \]
\subsection{Дирихле}
\label{sec:org6265a2f}
\begin{enumerate}
\item Частичные суммы ряда \(\sum a_n\) равномерно органичены \\
\(\exists C_a\ \forall N\ \forall x \in E\ |\sum_{k=1}^{N}a_k(x)| \le C_a\)
\item Фиксируем \(x\) b\textsubscript{n}(x) монотонна по \(n\) \\
b\textsubscript{n}(x) \(\rightarrow\) 0
\end{enumerate}
1), 2) \(\Rightarrow\) ряд равномерно сходится

\subsection{Абеля}
\label{sec:orgaf46b37}
\begin{enumerate}
\item \(\sum a_n(x)\) равномерно сходится
\item \(b_n(x)\) монотонна по \(n\) \\
\(b_n(x)\) равномерно ограничена \\
\(\exists C_b\ \forall n\ \forall x\ |b_n(x)| < C_b\)
\end{enumerate}
\subsection{Вейерштрасса}
\label{sec:org01836c9}
\[ \sum u_n(x)\ x \in E \]
\begin{enumerate}
\item \(\forall x \in E\ |u_n(x)\le C_n|\)
\item \(\sum C_n\) - сходится
\end{enumerate}
\section{Непрерывность и дифференцируемость}
\label{sec:orge48e05a}
\(\sum u_n(x) = f(x)\)
\begin{enumerate}
\item \begin{enumerate}
\item \(u_n(x)\) - непрерывна в \(x_0\)
\item ряд равномерно сходится в \(u(x_0)\)
\end{enumerate}
Тогда \(f\) - непрерывна в \(x_0\)
\item \(\sum u_n'(x) = \varphi(x)\) \\
\(\sum u_n'(x)\) - равномерно сходится в \(u(x_0)\) \\
Тогда \(f\) - дифференцируема в \(x_0\) и \(f'(x) = \varphi(x) = \sum u_n'(x)\)
\item Ряд \(\sum u_n(x)\) - равномерно сходится на \([a, b]\) \\
\(u_n(x)\) - непрерывна на \([a, b]\) \\
Тогда \(\int^a_b f(x) = \sum \int^a_b u_n(x)dx\)
\end{enumerate}
\section{Критерий Больциано-Коши}
\label{sec:org21eb678}
\(\exists \varepsilon > 0\ \forall N\ \exists n > N,\ \exists m \in \mathbb{N},\ \exists x\) \\
\(|u_{n + 1}(x) + \dots + u_{n + m}(x)| > \varepsilon\) \\
Если выполняеся то ряд сходится не равномерно \\
Можно выбрать \(m = 1\), тогда если \(\underset{x \in E}{\sup} u_n(x) \not \xrightarrow[x \to \infty]{} 0\), то ряд не равномерно сходящийся
\section{Разложение в ряд}
\label{sec:orgb8813bc}
\href{http://www.math24.ru/\%D1\%80\%D0\%B0\%D0\%B7\%D0\%BB\%D0\%BE\%D0\%B6\%D0\%B5\%D0\%BD\%D0\%B8\%D0\%B5-\%D1\%84\%D1\%83\%D0\%BD\%D0\%BA\%D1\%86\%D0\%B8\%D0\%B9-\%D0\%B2-\%D1\%81\%D1\%82\%D0\%B5\%D0\%BF\%D0\%B5\%D0\%BD\%D0\%BD\%D1\%8B\%D0\%B5-\%D1\%80\%D1\%8F\%D0\%B4\%D1\%8B.html}{Известные ряды} 

\((1 + x)^\alpha = 1 + \alpha x + \frac{\alpha(\alpha - 1)}{2!}x^2 + \frac{\alpha(\alpha - 1)(\alpha - 2)}{3!}x^3 + \dots,\ -1 < x < 1\) 
\section{Числовые ряды}
\label{sec:org1beadf9}
\begin{enumerate}
\item Прогрессия
\[ \sum_{n = 0}^{+\infty} q^n = \frac{1}{1 - q} \]
\item \[ e = 1 + \frac{1}{1!} + \frac{1}{2!} + \frac{1}{3!} + \dots \]
\item \[ \sum \frac{1}{n^2} = \frac{\pi^2}{6} \]
\item \[ \sum \frac{(-1)^{n + 1}}{n} = \ln 2 \]
\item \[ 1 - \frac{1}{3} + \frac{1}{5} - \frac{1}{7} + \dots = \frac{\pi}{4} \]
\item Телескопические
\[ \sum_{k = 1}^{+\infty} (a_k - a_{k + 1}) = a_1 - \lim_{n \to +\infty} a_n \]
\end{enumerate}
\end{document}
